#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.s3_bucket.aws_s3_bucket.s3_default[0] will be created
  + resource "aws_s3_bucket" "s3_default" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "test-secure-bucket-clouddrove"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = "eu-west-1"
      + request_payer               = (known after apply)
      + tags                        = {
          + "Application" = "clouddrove"
          + "CreatedBy"   = "terraform"
          + "Environment" = "test"
          + "ManagedBy"   = "anmol@clouddrove.com"
          + "Name"        = "test-secure-bucket-clouddrove"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + lifecycle_rule {
          + enabled = false
          + id      = "transition-to-infrequent-access-storage"

          + transition {
              + days          = 60
              + storage_class = "STANDARD_IA"
            }
        }
      + lifecycle_rule {
          + enabled = false
          + id      = "transition-to-glacier"

          + transition {
              + days          = 180
              + storage_class = "GLACIER"
            }
        }
      + lifecycle_rule {
          + enabled = false
          + id      = "expire-objects"

          + expiration {
              + days = 365
            }
        }

      + versioning {
          + enabled    = true
          + mfa_delete = false
        }
    }

  # module.vpc.aws_flow_log.vpc_flow_log[0] will be created
  + resource "aws_flow_log" "vpc_flow_log" {
      + id                   = (known after apply)
      + log_destination      = (known after apply)
      + log_destination_type = "s3"
      + log_format           = (known after apply)
      + log_group_name       = (known after apply)
      + traffic_type         = "ALL"
      + vpc_id               = (known after apply)
    }

  # module.vpc.aws_internet_gateway.default[0] will be created
  + resource "aws_internet_gateway" "default" {
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Application" = "clouddrove"
          + "CreatedBy"   = "terraform"
          + "Environment" = "test"
          + "ManagedBy"   = "anmol@clouddrove.com"
          + "Name"        = "test-clouddrove-vpc"
        }
      + vpc_id   = (known after apply)
    }

  # module.vpc.aws_vpc.default[0] will be created
  + resource "aws_vpc" "default" {
      + arn                              = (known after apply)
      + assign_generated_ipv6_cidr_block = true
      + cidr_block                       = "10.0.0.0/16"
      + default_network_acl_id           = (known after apply)
      + default_route_table_id           = (known after apply)
      + default_security_group_id        = (known after apply)
      + dhcp_options_id                  = (known after apply)
      + enable_classiclink               = false
      + enable_classiclink_dns_support   = false
      + enable_dns_hostnames             = true
      + enable_dns_support               = true
      + id                               = (known after apply)
      + instance_tenancy                 = "default"
      + ipv6_association_id              = (known after apply)
      + ipv6_cidr_block                  = (known after apply)
      + main_route_table_id              = (known after apply)
      + owner_id                         = (known after apply)
      + tags                             = {
          + "Application" = "clouddrove"
          + "CreatedBy"   = "terraform"
          + "Environment" = "test"
          + "ManagedBy"   = "anmol@clouddrove.com"
          + "Name"        = "test-clouddrove-vpc"
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```

</details>

*Workflow: `Terraform GitHub Actions`, Action: `hashicorpterraform-github-actions4`, Working Directory: `./_example`*
